Дошкольное_учреждение83/src/Catalogs/удуТипыРеестров/удуТипыРеестров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуТипыРеестров</name>
  <attributes>
    <name>СпособОтправки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>Нумератор</name>
    <type>
      <types>CatalogRef.Нумераторы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/СпособыНумерации/СпособыНумерации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНумерации</name>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуТипыРеестров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНумератор();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	НумераторДоступен = (Объект.СпособНумерации = Перечисления.СпособыНумерации.Автоматически);
	Элементы.Нумератор.Доступность = НумераторДоступен;
	Элементы.Нумератор.АвтоОтметкаНезаполненного = НумераторДоступен;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьНумератор()
	Если Объект.СпособНумерации = Перечисления.СпособыНумерации.Автоматически Тогда 
		Объект.Нумератор = Справочники.Нумераторы.ТипыРеестра;
	Иначе
		Объект.Нумератор = Справочники.Нумераторы.ПустаяСсылка();
		Элементы.Нумератор.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры // ОбновитьНумератор()

&НаКлиенте
Процедура СпособНумерацииПриИзменении(Элемент)
	 ОбновитьНумератор();
КонецПроцедуры
